{"keras_version": "2.0.6", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["sequential_1", 1, 0]], "layers": [{"inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "block1_conv1", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "activity_regularizer": null, "filters": 64, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "name": "block1_conv1"}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "block1_conv2", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "activity_regularizer": null, "filters": 64, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "name": "block1_conv2"}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": false, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "block1_pool"}, "class_name": "MaxPooling2D", "name": "block1_pool"}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "block2_conv1", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "activity_regularizer": null, "filters": 128, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "name": "block2_conv1"}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "block2_conv2", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "activity_regularizer": null, "filters": 128, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "name": "block2_conv2"}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": false, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "block2_pool"}, "class_name": "MaxPooling2D", "name": "block2_pool"}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "block3_conv1", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "name": "block3_conv1"}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "block3_conv2", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "name": "block3_conv2"}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "block3_conv3", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "name": "block3_conv3"}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": false, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "block3_pool"}, "class_name": "MaxPooling2D", "name": "block3_pool"}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "block4_conv1", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "name": "block4_conv1"}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "block4_conv2", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "name": "block4_conv2"}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "block4_conv3", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "name": "block4_conv3"}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": false, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "block4_pool"}, "class_name": "MaxPooling2D", "name": "block4_pool"}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "block5_conv1", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "name": "block5_conv1"}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "block5_conv2", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "name": "block5_conv2"}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "block5_conv3", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "name": "block5_conv3"}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "block5_pool"}, "class_name": "MaxPooling2D", "name": "block5_pool"}, {"inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": [{"config": {"trainable": true, "batch_input_shape": [null, 7, 7, 512], "dtype": "float32", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 256, "kernel_constraint": null, "name": "dense_1", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 151, "kernel_constraint": null, "name": "dense_2", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "name": "sequential_1"}], "name": "model_1"}, "class_name": "Model"}